﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿/=#
#include "VFR.uni"

//---------------------------------------------------------------------------
// Digital IO Port Configuration
//---------------------------------------------------------------------------
#string STR_DIO_FORM			#language eng "Digital IO Port Configuration"
#string STR_DIO_FORM_HELP		#language eng "Set Input/Output of Digital IO Port Configuration"

#string STR_AAEON_DIO_CALLBACK		#language eng "Item for a setup callback"
#string STR_AAEON_DIO_DUMMY		#language eng "N/A"

#string STR_DIO0_PROMPT			#language eng "DIO Port1"
#string STR_DIO1_PROMPT			#language eng "DIO Port2"
#string STR_DIO2_PROMPT			#language eng "DIO Port3"
#string STR_DIO3_PROMPT			#language eng "DIO Port4"
#string STR_DIO4_PROMPT			#language eng "DIO Port5"
#string STR_DIO5_PROMPT			#language eng "DIO Port6"
#string STR_DIO6_PROMPT			#language eng "DIO Port7"
#string STR_DIO7_PROMPT			#language eng "DIO Port8"
#string STR_DIO8_PROMPT			#language eng "DIO Port9"
#string STR_DIO9_PROMPT			#language eng "DIO Port10"
#string STR_DIO10_PROMPT		#language eng "DIO Port11"
#string STR_DIO11_PROMPT		#language eng "DIO Port12"
#string STR_DIO12_PROMPT		#language eng "DIO Port13"
#string STR_DIO13_PROMPT		#language eng "DIO Port14"
#string STR_DIO14_PROMPT		#language eng "DIO Port15"
#string STR_DIO15_PROMPT		#language eng "DIO Port16"
#string STR_DIO_DIR_HELP		#language eng "Set DIO as Input or Output"

#string STR_DIR_IN_OPTION		#language eng "Input "
#string STR_DIR_OUT_OPTION		#language eng "Output"

#string STR_DIO_LV_PROMPT		#language eng "  Output Level"
#string STR_DIO_LV_PROMPT_HELP		#language eng "Set output level when DIO pin is output"
#string STR_DIO_HI_OPTION		#language eng "High  "
#string STR_DIO_LOW_OPTION		#language eng "Low   "

#string STR_DIO_SOURCE_FORM		#language eng "DIO Control Configuration"
#string STR_DIO_SOURCE_FORM_HELP	#language eng "DIO Control Configuration"

#string STR_AAEON_DIO_SOURCE		#language eng "DIO Source"
#string STR_AAEON_DIO_SOURCE_HELP	#language eng "DIO Source selection"

#string STR_AAEON_DIO_GPIO		#language eng "  GPIO Number"
#string STR_AAEON_DIO_GPIO_HELP		#language eng "GPIO Number"

#string STR_DIO0_PROMPT			#language eng "DIO1"
#string STR_DIO1_PROMPT			#language eng "DIO2"
#string STR_DIO2_PROMPT			#language eng "DIO3"
#string STR_DIO3_PROMPT			#language eng "DIO4"
#string STR_DIO4_PROMPT			#language eng "DIO5"
#string STR_DIO5_PROMPT			#language eng "DIO6"
#string STR_DIO6_PROMPT			#language eng "DIO7"
#string STR_DIO7_PROMPT			#language eng "DIO8"
#string STR_DIO8_PROMPT			#language eng "DIO9"
#string STR_DIO9_PROMPT			#language eng "DIO10"
#string STR_DIO10_PROMPT		#language eng "DIO11"
#string STR_DIO11_PROMPT		#language eng "DIO12"
#string STR_DIO12_PROMPT		#language eng "DIO13"
#string STR_DIO13_PROMPT		#language eng "DIO14"
#string STR_DIO14_PROMPT		#language eng "DIO15"
#string STR_DIO15_PROMPT		#language eng "DIO16"